In [2]:
import numpy as np
import pandas as pd

In [2]:
#Creating a dataframe from a random array
pd.DataFrame(np.random.randint(0, 100, (100, 5)))

     0   1   2   3   4
0   82  70  38  25  15
1   10  12  97  44  56
2   17  13   7  51  72
3   51  94  63  76  77
4    2  26  98  10  87
..  ..  ..  ..  ..  ..
95  10  40  92  96  26
96  42  23  79  12  39
97  40  66  13   8  17
98  68  76  62   8  72
99  91   4  77  42  75

[100 rows x 5 columns]

In [2]:
#Creating a dataframe with specified index and column names
df = pd.DataFrame(np.random.randint(1, 100, (5,5)), index=['A', 'B', 'C', 'D', 'E'], columns=['V', 'W', 'X', 'Y', 'Z'])
df

    V   W   X   Y   Z
A   5  99  73  52   8
B  63  41  37  60  65
C  24  56   9  84   4
D  98   3  91  47  80
E  38  49  50  15  46

In [3]:
df['W']

A    64
B    62
C    80
D    38
E    63
Name: W, dtype: int64

In [4]:
df[['W', 'Z', 'X']]

    W   Z   X
A  64  83  60
B  62  25  46
C  80  65  28
D  38  25  67
E  63   6  95

In [5]:
df['W']['A']

64

In [6]:
df['NC'] = df['W'] + df['Z']

In [7]:
df

    V   W   X   Y   Z   NC
A  41  64  60  34  83  147
B   8  62  46   3  25   87
C   7  80  28  20  65  145
D  69  38  67  46  25   63
E  60  63  95  11   6   69

In [9]:
df['Z'] = [0, 1, 2, 3, 4]

In [10]:
df

    V   W   X   Y  Z   NC
A  41  64  60  34  0  147
B   8  62  46   3  1   87
C   7  80  28  20  2  145
D  69  38  67  46  3   63
E  60  63  95  11  4   69

In [12]:
df.drop('NC', axis=1)

    V   W   X   Y  Z
A  41  64  60  34  0
B   8  62  46   3  1
C   7  80  28  20  2
D  69  38  67  46  3
E  60  63  95  11  4

In [13]:
df

    V   W   X   Y  Z   NC
A  41  64  60  34  0  147
B   8  62  46   3  1   87
C   7  80  28  20  2  145
D  69  38  67  46  3   63
E  60  63  95  11  4   69

In [14]:
#Permanently drops a column 
df.drop('NC', axis=1, inplace=True)

In [15]:
df

    V   W   X   Y  Z
A  41  64  60  34  0
B   8  62  46   3  1
C   7  80  28  20  2
D  69  38  67  46  3
E  60  63  95  11  4

In [16]:
df['Z']

A    0
B    1
C    2
D    3
E    4
Name: Z, dtype: int64

In [18]:
df.loc['C']

V     7
W    80
X    28
Y    20
Z     2
Name: C, dtype: int64

In [19]:
df.loc[['A', 'B', 'C']]

    V   W   X   Y  Z
A  41  64  60  34  0
B   8  62  46   3  1
C   7  80  28  20  2

In [20]:
df['W']

A    64
B    62
C    80
D    38
E    63
Name: W, dtype: int64

In [21]:
df['W']>50

A     True
B     True
C     True
D    False
E     True
Name: W, dtype: bool

In [22]:
df[df['W']>50]

    V   W   X   Y  Z
A  41  64  60  34  0
B   8  62  46   3  1
C   7  80  28  20  2
E  60  63  95  11  4

In [23]:
df[df['W']>50]['X']

A    60
B    46
C    28
E    95
Name: X, dtype: int64

In [3]:
df

    V   W   X   Y   Z
A   5  99  73  52   8
B  63  41  37  60  65
C  24  56   9  84   4
D  98   3  91  47  80
E  38  49  50  15  46

In [4]:
newCol = ['S', 'T', 'U', 'D', 'Y']
df['NewCol'] = newCol

In [5]:
df

    V   W   X   Y   Z NewCol
A   5  99  73  52   8      S
B  63  41  37  60  65      T
C  24  56   9  84   4      U
D  98   3  91  47  80      D
E  38  49  50  15  46      Y

In [9]:
newdf = df.set_index('NewCol')

In [10]:
newdf

         V   W   X   Y   Z
NewCol
S        5  99  73  52   8
T       63  41  37  60  65
U       24  56   9  84   4
D       98   3  91  47  80
Y       38  49  50  15  46

In [11]:
df

    V   W   X   Y   Z NewCol
A   5  99  73  52   8      S
B  63  41  37  60  65      T
C  24  56   9  84   4      U
D  98   3  91  47  80      D
E  38  49  50  15  46      Y

## Missing Values

In [12]:
myDict = {'a':[1, 0.5, np.nan], 'b':[np.nan, 2, np.nan], 'c':[1, 2, 3]}
dictDf = pd.DataFrame(myDict)
dictDf

     a    b  c
0  1.0  NaN  1
1  0.5  2.0  2
2  NaN  NaN  3

In [13]:
dictDf.isnull()

       a      b      c
0  False   True  False
1  False  False  False
2   True   True  False

In [14]:
dictDf.dropna()

     a    b  c
1  0.5  2.0  2

In [15]:
dictDf.dropna(axis=1)

   c
0  1
1  2
2  3

In [17]:
dictDf.dropna(thresh=2)

     a    b  c
0  1.0  NaN  1
1  0.5  2.0  2

In [18]:
dictDf

     a    b  c
0  1.0  NaN  1
1  0.5  2.0  2
2  NaN  NaN  3

In [19]:
dictDf.fillna("FILL")

      a     b  c
0     1  FILL  1
1   0.5     2  2
2  FILL  FILL  3

In [20]:
dictDf.fillna(0)

     a    b  c
0  1.0  0.0  1
1  0.5  2.0  2
2  0.0  0.0  3

## Aggregate Functions

In [21]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [22]:
df['Sales'].sum()

1377

In [23]:
df['Sales'].mean()

229.5

In [25]:
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [26]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [27]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [28]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [29]:
df['Sales'].min()

120

In [30]:
df[df['Sales'] == df['Sales'].min()]

  Company   Person  Sales
1    GOOG  Charlie    120

In [31]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [32]:
df['Company'].unique()

array(['GOOG', 'MSFT', 'FB'], dtype=object)

In [33]:
df['Company'].nunique()

3

In [39]:
df['Company'].value_counts()

GOOG    2
FB      2
MSFT    2
Name: Company, dtype: int64

In [40]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [41]:
def timesTen(sales):
    return sales*10

df['Sales'].apply(timesTen)

0    2000
1    1200
2    3400
3    1240
4    2430
5    3500
Name: Sales, dtype: int64

In [42]:
df['Sales'].apply(lambda x:x*10)

0    2000
1    1200
2    3400
3    1240
4    2430
5    3500
Name: Sales, dtype: int64

In [43]:
df['Sales'] = df['Sales'].apply(lambda x:x*10)
df

  Company   Person  Sales
0    GOOG      Sam   2000
1    GOOG  Charlie   1200
2    MSFT      Amy   3400
3    MSFT  Vanessa   1240
4      FB     Carl   2430
5      FB    Sarah   3500

In [44]:
df.describe()

             Sales
count     6.000000
mean   2295.000000
std    1008.994549
min    1200.000000
25%    1430.000000
50%    2215.000000
75%    3157.500000
max    3500.000000

In [45]:
df.groupby('Company').describe()

        Sales
        count    mean          std     min     25%     50%     75%     max
Company
FB        2.0  2965.0   756.604256  2430.0  2697.5  2965.0  3232.5  3500.0
GOOG      2.0  1600.0   565.685425  1200.0  1400.0  1600.0  1800.0  2000.0
MSFT      2.0  2320.0  1527.350647  1240.0  1780.0  2320.0  2860.0  3400.0

# Joining

In [3]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [4]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [5]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11